# THIS FILE IS AUTOMATICALLY GENERATED
# Project: E:\PSoC_Creator\CY8CKIT-059\CY8CKIT-059_Simple_SDR_Receiver\CY8CKIT-059_Simple_SDR_Receiver.cydsn\CY8CKIT-059_Simple_SDR_Receiver.cyprj
# Date: Sat, 22 Jun 2019 11:46:25 GMT
#set_units -time ns
create_clock -name {ADC_Ext_CP_Clk(routed)} -period 15.151515151515152 -waveform {0 7.57575757575758} [list [get_pins {ClockBlock/dclk_0}]]
create_clock -name {Clock_2kHz(routed)} -period 500000 -waveform {0 250000} [list [get_pins {ClockBlock/dclk_1}]]
create_clock -name {CyILO} -period 10000 -waveform {0 5000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 15.151515151515152 -waveform {0 7.57575757575758} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 15.151515151515152 -waveform {0 7.57575757575758} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_clock -name {ADC_Ext_CP_Clk} -period 15.151515151515152 -waveform {0 7.57575757575758} [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {ADC_theACLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 11 23} [list [get_pins {ClockBlock/aclk_glb_0}]]
create_generated_clock -name {Clock_2kHz} -source [get_pins {ClockBlock/clk_sync}] -edges {1 33001 66001} -nominal_period 500000 [list [get_pins {ClockBlock/dclk_glb_1}]]

set_false_path -from [get_pins {__ONE__/q}]

# Component constraints for E:\PSoC_Creator\CY8CKIT-059\CY8CKIT-059_Simple_SDR_Receiver\CY8CKIT-059_Simple_SDR_Receiver.cydsn\TopDesign\TopDesign.cysch
# Project: E:\PSoC_Creator\CY8CKIT-059\CY8CKIT-059_Simple_SDR_Receiver\CY8CKIT-059_Simple_SDR_Receiver.cydsn\CY8CKIT-059_Simple_SDR_Receiver.cyprj
# Date: Sat, 22 Jun 2019 11:46:16 GMT
